In [16]:
import pandas as pd
df=pd.read_excel(r'C:\Users\Lenovo\Desktop\Sample_Data.xlsx')
df

    Height  Weight  Last score  Score Grade
0      229      75          75     88     A
1      231      22          66     75     B
2      233     -31          57     62     C
..     ...     ...         ...    ...   ...
6      241    -243          21     10     C
7      243    -296          12     -3     D
8      245    -349           3    -16     A

[9 rows x 5 columns]

In [17]:
df1=pd.set_option('display.max_columns',5)

In [18]:
pd.set_option('display.max_rows',7)

In [19]:
df1

In [20]:
df.head()

   Height  Weight  Last score  Score Grade
0     229      75          75     88     A
1     231      22          66     75     B
2     233     -31          57     62     C
3     235     -84          48     49     D
4     237    -137          39     36     A

In [21]:
people={'first':['arjun','sumesh'],'last':['prakash','jitheesh'],'email':['arjuntvm@gmail.com','sumeshtvm@gmail.com']}
people['email']
people['first']

['arjun', 'sumesh']

In [22]:
import pandas as pd
df=pd.DataFrame(people)
df

    first      last                email
0   arjun   prakash   arjuntvm@gmail.com
1  sumesh  jitheesh  sumeshtvm@gmail.com

In [23]:
df['email']

0     arjuntvm@gmail.com
1    sumeshtvm@gmail.com
Name: email, dtype: object

In [24]:
df.email

0     arjuntvm@gmail.com
1    sumeshtvm@gmail.com
Name: email, dtype: object

In [25]:
df[['last','email']]

       last                email
0   prakash   arjuntvm@gmail.com
1  jitheesh  sumeshtvm@gmail.com

In [26]:
df.iloc[[0],[1,2]]

      last               email
0  prakash  arjuntvm@gmail.com

In [27]:
df.loc[[0,1],['email','last']]

                 email      last
0   arjuntvm@gmail.com   prakash
1  sumeshtvm@gmail.com  jitheesh

In [28]:
df.set_index('email',inplace=True)

In [29]:
df.index

Index(['arjuntvm@gmail.com', 'sumeshtvm@gmail.com'], dtype='object', name='email')

In [30]:
df.loc['arjuntvm@gmail.com']

first      arjun
last     prakash
Name: arjuntvm@gmail.com, dtype: object

In [38]:
df.sort_index(inplace=True)

In [35]:
df

                      first      last
email
arjuntvm@gmail.com    arjun   prakash
sumeshtvm@gmail.com  sumesh  jitheesh